{"class_name": "Model", "config": {"name": "model_11", "layers": [{"name": "input_11", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 720, 1280, 3], "dtype": "float32", "sparse": false, "name": "input_11"}, "inbound_nodes": []}, {"name": "conv2d_151", "class_name": "Conv2D", "config": {"name": "conv2d_151", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_11", 0, 0, {}]]]}, {"name": "max_pooling2d_51", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_51", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_151", 0, 0, {}]]]}, {"name": "leaky_re_lu_251", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_251", "trainable": true, "alpha": 0.30000001192092896}, "inbound_nodes": [[["max_pooling2d_51", 0, 0, {}]]]}, {"name": "conv2d_152", "class_name": "Conv2D", "config": {"name": "conv2d_152", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_251", 0, 0, {}]]]}, {"name": "leaky_re_lu_252", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_252", "trainable": true, "alpha": 0.30000001192092896}, "inbound_nodes": [[["conv2d_152", 0, 0, {}]]]}, {"name": "conv2d_153", "class_name": "Conv2D", "config": {"name": "conv2d_153", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_252", 0, 0, {}]]]}, {"name": "max_pooling2d_52", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_52", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_153", 0, 0, {}]]]}, {"name": "leaky_re_lu_253", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_253", "trainable": true, "alpha": 0.30000001192092896}, "inbound_nodes": [[["max_pooling2d_52", 0, 0, {}]]]}, {"name": "conv2d_154", "class_name": "Conv2D", "config": {"name": "conv2d_154", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_253", 0, 0, {}]]]}, {"name": "leaky_re_lu_254", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_254", "trainable": true, "alpha": 0.30000001192092896}, "inbound_nodes": [[["conv2d_154", 0, 0, {}]]]}, {"name": "conv2d_155", "class_name": "Conv2D", "config": {"name": "conv2d_155", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_254", 0, 0, {}]]]}, {"name": "max_pooling2d_53", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_53", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_155", 0, 0, {}]]]}, {"name": "leaky_re_lu_255", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_255", "trainable": true, "alpha": 0.30000001192092896}, "inbound_nodes": [[["max_pooling2d_53", 0, 0, {}]]]}, {"name": "conv2d_156", "class_name": "Conv2D", "config": {"name": "conv2d_156", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_255", 0, 0, {}]]]}, {"name": "leaky_re_lu_256", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_256", "trainable": true, "alpha": 0.30000001192092896}, "inbound_nodes": [[["conv2d_156", 0, 0, {}]]]}, {"name": "conv2d_157", "class_name": "Conv2D", "config": {"name": "conv2d_157", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_256", 0, 0, {}]]]}, {"name": "max_pooling2d_54", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_54", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_157", 0, 0, {}]]]}, {"name": "leaky_re_lu_257", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_257", "trainable": true, "alpha": 0.30000001192092896}, "inbound_nodes": [[["max_pooling2d_54", 0, 0, {}]]]}, {"name": "conv2d_158", "class_name": "Conv2D", "config": {"name": "conv2d_158", "trainable": true, "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_257", 0, 0, {}]]]}, {"name": "leaky_re_lu_258", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_258", "trainable": true, "alpha": 0.30000001192092896}, "inbound_nodes": [[["conv2d_158", 0, 0, {}]]]}, {"name": "conv2d_159", "class_name": "Conv2D", "config": {"name": "conv2d_159", "trainable": true, "filters": 192, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_258", 0, 0, {}]]]}, {"name": "max_pooling2d_55", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_55", "trainable": true, "pool_size": [5, 5], "padding": "valid", "strides": [5, 5], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_159", 0, 0, {}]]]}, {"name": "leaky_re_lu_259", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_259", "trainable": true, "alpha": 0.30000001192092896}, "inbound_nodes": [[["max_pooling2d_55", 0, 0, {}]]]}, {"name": "conv2d_160", "class_name": "Conv2D", "config": {"name": "conv2d_160", "trainable": true, "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_259", 0, 0, {}]]]}, {"name": "leaky_re_lu_260", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_260", "trainable": true, "alpha": 0.30000001192092896}, "inbound_nodes": [[["conv2d_160", 0, 0, {}]]]}, {"name": "conv2d_161", "class_name": "Conv2D", "config": {"name": "conv2d_161", "trainable": true, "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_260", 0, 0, {}]]]}, {"name": "leaky_re_lu_261", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_261", "trainable": true, "alpha": 0.30000001192092896}, "inbound_nodes": [[["conv2d_161", 0, 0, {}]]]}, {"name": "conv2d_transpose_101", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_101", "trainable": true, "filters": 192, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_261", 0, 0, {}]]]}, {"name": "up_sampling2d_51", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_51", "trainable": true, "size": [5, 5], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_transpose_101", 0, 0, {}]]]}, {"name": "leaky_re_lu_262", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_262", "trainable": true, "alpha": 0.30000001192092896}, "inbound_nodes": [[["up_sampling2d_51", 0, 0, {}]]]}, {"name": "conv2d_transpose_102", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_102", "trainable": true, "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_262", 0, 0, {}]]]}, {"name": "leaky_re_lu_263", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_263", "trainable": true, "alpha": 0.30000001192092896}, "inbound_nodes": [[["conv2d_transpose_102", 0, 0, {}]]]}, {"name": "activation_44", "class_name": "Activation", "config": {"name": "activation_44", "trainable": true, "activation": "linear"}, "inbound_nodes": [[["leaky_re_lu_257", 0, 0, {}]]]}, {"name": "concatenate_41", "class_name": "Concatenate", "config": {"name": "concatenate_41", "trainable": true, "axis": -1}, "inbound_nodes": [[["leaky_re_lu_263", 0, 0, {}], ["activation_44", 0, 0, {}]]]}, {"name": "conv2d_transpose_103", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_103", "trainable": true, "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_41", 0, 0, {}]]]}, {"name": "leaky_re_lu_264", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_264", "trainable": true, "alpha": 0.30000001192092896}, "inbound_nodes": [[["conv2d_transpose_103", 0, 0, {}]]]}, {"name": "conv2d_162", "class_name": "Conv2D", "config": {"name": "conv2d_162", "trainable": true, "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_264", 0, 0, {}]]]}, {"name": "up_sampling2d_52", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_52", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_162", 0, 0, {}]]]}, {"name": "leaky_re_lu_265", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_265", "trainable": true, "alpha": 0.30000001192092896}, "inbound_nodes": [[["up_sampling2d_52", 0, 0, {}]]]}, {"name": "conv2d_transpose_104", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_104", "trainable": true, "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_265", 0, 0, {}]]]}, {"name": "leaky_re_lu_266", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_266", "trainable": true, "alpha": 0.30000001192092896}, "inbound_nodes": [[["conv2d_transpose_104", 0, 0, {}]]]}, {"name": "activation_43", "class_name": "Activation", "config": {"name": "activation_43", "trainable": true, "activation": "linear"}, "inbound_nodes": [[["leaky_re_lu_255", 0, 0, {}]]]}, {"name": "concatenate_42", "class_name": "Concatenate", "config": {"name": "concatenate_42", "trainable": true, "axis": -1}, "inbound_nodes": [[["leaky_re_lu_266", 0, 0, {}], ["activation_43", 0, 0, {}]]]}, {"name": "conv2d_transpose_105", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_105", "trainable": true, "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_42", 0, 0, {}]]]}, {"name": "leaky_re_lu_267", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_267", "trainable": true, "alpha": 0.30000001192092896}, "inbound_nodes": [[["conv2d_transpose_105", 0, 0, {}]]]}, {"name": "conv2d_163", "class_name": "Conv2D", "config": {"name": "conv2d_163", "trainable": true, "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_267", 0, 0, {}]]]}, {"name": "up_sampling2d_53", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_53", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_163", 0, 0, {}]]]}, {"name": "leaky_re_lu_268", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_268", "trainable": true, "alpha": 0.30000001192092896}, "inbound_nodes": [[["up_sampling2d_53", 0, 0, {}]]]}, {"name": "conv2d_transpose_106", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_106", "trainable": true, "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_268", 0, 0, {}]]]}, {"name": "leaky_re_lu_269", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_269", "trainable": true, "alpha": 0.30000001192092896}, "inbound_nodes": [[["conv2d_transpose_106", 0, 0, {}]]]}, {"name": "activation_42", "class_name": "Activation", "config": {"name": "activation_42", "trainable": true, "activation": "linear"}, "inbound_nodes": [[["leaky_re_lu_253", 0, 0, {}]]]}, {"name": "concatenate_43", "class_name": "Concatenate", "config": {"name": "concatenate_43", "trainable": true, "axis": -1}, "inbound_nodes": [[["leaky_re_lu_269", 0, 0, {}], ["activation_42", 0, 0, {}]]]}, {"name": "conv2d_transpose_107", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_107", "trainable": true, "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_43", 0, 0, {}]]]}, {"name": "leaky_re_lu_270", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_270", "trainable": true, "alpha": 0.30000001192092896}, "inbound_nodes": [[["conv2d_transpose_107", 0, 0, {}]]]}, {"name": "conv2d_164", "class_name": "Conv2D", "config": {"name": "conv2d_164", "trainable": true, "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_270", 0, 0, {}]]]}, {"name": "up_sampling2d_54", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_54", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_164", 0, 0, {}]]]}, {"name": "leaky_re_lu_271", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_271", "trainable": true, "alpha": 0.30000001192092896}, "inbound_nodes": [[["up_sampling2d_54", 0, 0, {}]]]}, {"name": "conv2d_transpose_108", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_108", "trainable": true, "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_271", 0, 0, {}]]]}, {"name": "leaky_re_lu_272", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_272", "trainable": true, "alpha": 0.30000001192092896}, "inbound_nodes": [[["conv2d_transpose_108", 0, 0, {}]]]}, {"name": "activation_41", "class_name": "Activation", "config": {"name": "activation_41", "trainable": true, "activation": "linear"}, "inbound_nodes": [[["leaky_re_lu_251", 0, 0, {}]]]}, {"name": "concatenate_44", "class_name": "Concatenate", "config": {"name": "concatenate_44", "trainable": true, "axis": -1}, "inbound_nodes": [[["leaky_re_lu_272", 0, 0, {}], ["activation_41", 0, 0, {}]]]}, {"name": "conv2d_transpose_109", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_109", "trainable": true, "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_44", 0, 0, {}]]]}, {"name": "leaky_re_lu_273", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_273", "trainable": true, "alpha": 0.30000001192092896}, "inbound_nodes": [[["conv2d_transpose_109", 0, 0, {}]]]}, {"name": "batch_normalization_11", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_11", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["leaky_re_lu_273", 0, 0, {}]]]}, {"name": "conv2d_165", "class_name": "Conv2D", "config": {"name": "conv2d_165", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"name": "up_sampling2d_55", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_55", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_165", 0, 0, {}]]]}, {"name": "leaky_re_lu_274", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_274", "trainable": true, "alpha": 0.30000001192092896}, "inbound_nodes": [[["up_sampling2d_55", 0, 0, {}]]]}, {"name": "conv2d_transpose_110", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_110", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_274", 0, 0, {}]]]}, {"name": "leaky_re_lu_275", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_275", "trainable": true, "alpha": 0.30000001192092896}, "inbound_nodes": [[["conv2d_transpose_110", 0, 0, {}]]]}, {"name": "dense_11", "class_name": "Dense", "config": {"name": "dense_11", "trainable": true, "units": 19, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_275", 0, 0, {}]]]}], "input_layers": [["input_11", 0, 0]], "output_layers": [["dense_11", 0, 0]]}, "keras_version": "2.2.0", "backend": "tensorflow"}